In [1]:
import numpy as np
import pandas as pd

In [2]:
boston_url = "https://andybek.com/pandas-marathon"

In [3]:
boston = pd.read_csv(boston_url)

In [4]:
boston.head()

,Name,Age,M/F,City,State,Country,Official Time,Overall,Gender,Years Ran
0,"Kirui, Geoffrey",24,M,Keringet,NaN,KEN,2:09:37,1,1,NaN
1,"Rupp, Galen",30,M,Portland,OR,USA,2:09:58,2,2,NaN
2,"Osako, Suguru",25,M,Machida-City,NaN,JPN,2:10:28,3,3,NaN
3,"Biwott, Shadrack",32,M,Mammoth Lakes,CA,USA,2:12:08,4,4,NaN
4,"Chebet, Wilson",31,M,Marakwet,NaN,KEN,2:12:35,5,5,2015

In [5]:
boston.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 10 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Name           1000 non-null   object
 1   Age            1000 non-null   int64
 2   M/F            1000 non-null   object
 3   City           1000 non-null   object
 4   State          807 non-null    object
 5   Country        1000 non-null   object
 6   Official Time  1000 non-null   object
 7   Overall        1000 non-null   int64
 8   Gender         1000 non-null   int64
 9   Years Ran      315 non-null    object
dtypes: int64(3), object(7)
memory usage: 78.2+ KB

# Agenda
- len
- center
- startswith , endswith
- the "in"  operator
- list comprehension

In [6]:
# len
# this describes the lenght of the string
len('the boy cannot go home')

22

In [7]:
# center
d = 'the boy can do it'

In [8]:
d.center(40, '>')

'>>>>>>>>>>>the boy can do it>>>>>>>>>>>>'

In [9]:
#starts with
d.startswith('t'), d.endswith('t')

(True, True)

In [10]:
# in operator, either way
'f' in d  , d in 'f'

(False, False)

In [11]:
# the list comprehension

In [12]:
names = ['anna', 'welbeck', 'ronaldo','zlatan','kiki']

In [13]:
# run a program to return their length
lengths = []
for name in names:
    print(len(name))

4
7
7
6
4

In [14]:
[len(name) for name in names]

[4, 7, 7, 6, 4]

In [15]:
import string

In [16]:
from string import ascii_lowercase

In [17]:
t = ascii_lowercase

In [18]:
t

'abcdefghijklmnopqrstuvwxyz'

In [19]:
# run a program to check if each name starts with a
lengths = []
for name in names:
    print(name.startswith('r'))

False
False
True
False
False

In [20]:
[name.startswith('r') for name in names]

[False, False, True, False, False]

In [21]:
boston.head()

,Name,Age,M/F,City,State,Country,Official Time,Overall,Gender,Years Ran
0,"Kirui, Geoffrey",24,M,Keringet,NaN,KEN,2:09:37,1,1,NaN
1,"Rupp, Galen",30,M,Portland,OR,USA,2:09:58,2,2,NaN
2,"Osako, Suguru",25,M,Machida-City,NaN,JPN,2:10:28,3,3,NaN
3,"Biwott, Shadrack",32,M,Mammoth Lakes,CA,USA,2:12:08,4,4,NaN
4,"Chebet, Wilson",31,M,Marakwet,NaN,KEN,2:12:35,5,5,2015

In [22]:
# you need the .str to access the len of texts in pandas
# lets add a column for the length of the names
boston['len_Name'] = boston.Name.str.len()

In [23]:
boston = boston.reindex(['Name','len_Name','Age','M/F','City', 'State', 'Country', 'Official Time', 'Overall','Gender', 'Years Ran' ],axis =1)

In [24]:
[column for column in boston.columns]

['Name',
 'len_Name',
 'Age',
 'M/F',
 'City',
 'State',
 'Country',
 'Official Time',
 'Overall',
 'Gender',
 'Years Ran']

In [25]:
boston

,Name,len_Name,Age,M/F,City,State,Country,Official Time,Overall,Gender,Years Ran
0,"Kirui, Geoffrey",17,24,M,Keringet,NaN,KEN,2:09:37,1,1,NaN
1,"Rupp, Galen",14,30,M,Portland,OR,USA,2:09:58,2,2,NaN
2,"Osako, Suguru",15,25,M,Machida-City,NaN,JPN,2:10:28,3,3,NaN
3,"Biwott, Shadrack",16,32,M,Mammoth Lakes,CA,USA,2:12:08,4,4,NaN
4,"Chebet, Wilson",14,31,M,Marakwet,NaN,KEN,2:12:35,5,5,2015
...,...,...,...,...,...,...,...,...,...,...,...
995,"Larosa, Mark",12,38,M,North Andover,MA,USA,2:56:06,996,940,2015:2016
996,"Williamson, Jerry A",19,43,M,Raleigh,NC,USA,2:56:06,997,941,2015
997,"Mccue, Daniel T",15,40,M,Arlington,MA,USA,2:56:06,998,942,NaN
998,"Larosa, John",12,35,M,Danbury,CT,USA,2:56:07,999,943,NaN
999,"Sanchez, Sam R",14,35,M,Santa Fe,NM,USA,2:56:08,1000,944,NaN

# Agenda
- title( )
- upper( )
- lower( )
- swapcase( )
- capitalize( )

In [26]:
boston.City.str.capitalize()

0           Keringet
1           Portland
2       Machida-city
3      Mammoth lakes
4           Marakwet
           ...
995    North andover
996          Raleigh
997        Arlington
998          Danbury
999         Santa fe
Name: City, Length: 1000, dtype: object

# Agenda
- find( )
- rfind ( )

In [27]:
" The mountain for redemption sis allwwksnksh ".rfind('demp')

20

In [28]:
# how many top marathon runner have "nd" in their names
boston.Name.str.center(30,"|")

0      |||||| Kirui, Geoffrey |||||||
1      ||||||||Rupp, Galen   ||||||||
2      |||||||Osako, Suguru  ||||||||
3      |||||||Biwott, Shadrack|||||||
4      ||||||||Chebet, Wilson||||||||
                    ...
995    |||||||||Larosa, Mark|||||||||
996    |||||Williamson, Jerry A||||||
997    |||||||Mccue, Daniel T||||||||
998    |||||||||Larosa, John|||||||||
999    ||||||||Sanchez, Sam R||||||||
Name: Name, Length: 1000, dtype: object

# Agenda
- isspace( )
- lstrip( )
- rstrip( )
-strip( )

In [29]:
r =' \t'

In [30]:
r.isspace()

True

In [31]:
' hirir'.lstrip()

'hirir'

In [32]:
boston.Name = boston.Name.str.strip()

In [33]:
boston.Name.str.isspace().value_counts()

False    1000
Name: Name, dtype: int64

# Agenda
- split ( )
- get( )
- cat ( )

In [34]:
q = "How can I get my own personalized email address?"

In [35]:
q.strip()

'How can I get my own personalized email address?'

In [36]:
q.split(" ")

['How', 'can', 'I', 'get', 'my', 'own', 'personalized', 'email', 'address?']

In [37]:
# split firstname and lastname
boston['firstname'] = boston.Name.str.split(", ",).str.get(0)
boston['lastname'] = boston.Name.str.split(", ",).str.get(1)

In [38]:
boston.firstname.str.cat(boston.lastname, sep=" ")

0          Kirui Geoffrey
1              Rupp Galen
2            Osako Suguru
3         Biwott Shadrack
4           Chebet Wilson
              ...
995           Larosa Mark
996    Williamson Jerry A
997        Mccue Daniel T
998           Larosa John
999         Sanchez Sam R
Name: firstname, Length: 1000, dtype: object

In [39]:
 "The man, Mr.Baldwin".split(", ")[1][:2]

'Mr'

In [41]:
# boston.drop('lastnamename',axis =1, inplace = True)

In [42]:
boston.head()

,Name,len_Name,Age,M/F,City,State,Country,Official Time,Overall,Gender,Years Ran,firstname,lastname
0,"Kirui, Geoffrey",17,24,M,Keringet,NaN,KEN,2:09:37,1,1,NaN,Kirui,Geoffrey
1,"Rupp, Galen",14,30,M,Portland,OR,USA,2:09:58,2,2,NaN,Rupp,Galen
2,"Osako, Suguru",15,25,M,Machida-City,NaN,JPN,2:10:28,3,3,NaN,Osako,Suguru
3,"Biwott, Shadrack",16,32,M,Mammoth Lakes,CA,USA,2:12:08,4,4,NaN,Biwott,Shadrack
4,"Chebet, Wilson",14,31,M,Marakwet,NaN,KEN,2:12:35,5,5,2015,Chebet,Wilson

In [43]:
# merge Age and Gender

In [44]:
# how many names has Janes as Last name
boston.lastname[boston.lastname.str.contains('James')].value_counts()

James       5
James L     1
James P     1
James A     1
James P.    1
James B     1
James D.    1
James R     1
Name: lastname, dtype: int64

In [45]:
# how many names has Janes as Last name
boston.lastname.str.find('James').value_counts()

-1    988
 0     12
Name: lastname, dtype: int64

In [46]:
boston['City2'] =boston.City.str.split("-").str.get(1)
boston['City1'] =boston.City.str.split("-").str.get(0)

In [47]:
boston

,Name,len_Name,Age,M/F,City,State,Country,Official Time,Overall,Gender,Years Ran,firstname,lastname,City2,City1
0,"Kirui, Geoffrey",17,24,M,Keringet,NaN,KEN,2:09:37,1,1,NaN,Kirui,Geoffrey,NaN,Keringet
1,"Rupp, Galen",14,30,M,Portland,OR,USA,2:09:58,2,2,NaN,Rupp,Galen,NaN,Portland
2,"Osako, Suguru",15,25,M,Machida-City,NaN,JPN,2:10:28,3,3,NaN,Osako,Suguru,City,Machida
3,"Biwott, Shadrack",16,32,M,Mammoth Lakes,CA,USA,2:12:08,4,4,NaN,Biwott,Shadrack,NaN,Mammoth Lakes
4,"Chebet, Wilson",14,31,M,Marakwet,NaN,KEN,2:12:35,5,5,2015,Chebet,Wilson,NaN,Marakwet
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,"Larosa, Mark",12,38,M,North Andover,MA,USA,2:56:06,996,940,2015:2016,Larosa,Mark,NaN,North Andover
996,"Williamson, Jerry A",19,43,M,Raleigh,NC,USA,2:56:06,997,941,2015,Williamson,Jerry A,NaN,Raleigh
997,"Mccue, Daniel T",15,40,M,Arlington,MA,USA,2:56:06,998,942,NaN,Mccue,Daniel T,NaN,Arlington
998,"Larosa, John",12,35,M,Danbury,CT,USA,2:56:07,999,943,NaN,Larosa,John,NaN,Danbury
999,"Sanchez, Sam R",14,35,M,Santa Fe,NM,USA,2:56:08,1000,944,NaN,Sanchez,Sam R,NaN,Santa Fe

In [48]:
boston = boston.reindex(['Name','len_Name','Age','M/F','City',"City1" ,"City2",'State', 'Country', 'Official Time', 'Overall','Gender', 'Years Ran' ],axis =1)

In [49]:
boston.head()

,Name,len_Name,Age,M/F,City,City1,City2,State,Country,Official Time,Overall,Gender,Years Ran
0,"Kirui, Geoffrey",17,24,M,Keringet,Keringet,NaN,NaN,KEN,2:09:37,1,1,NaN
1,"Rupp, Galen",14,30,M,Portland,Portland,NaN,OR,USA,2:09:58,2,2,NaN
2,"Osako, Suguru",15,25,M,Machida-City,Machida,City,NaN,JPN,2:10:28,3,3,NaN
3,"Biwott, Shadrack",16,32,M,Mammoth Lakes,Mammoth Lakes,NaN,CA,USA,2:12:08,4,4,NaN
4,"Chebet, Wilson",14,31,M,Marakwet,Marakwet,NaN,NaN,KEN,2:12:35,5,5,2015

# String Replacement

In [51]:
ter = "Urban population (% of total) Urban population refers to people living in urban areas as defined by national statistical offices"

In [52]:
ter.replace("Urban", "City")

'City population (% of total) City population refers to people living in urban areas as defined by national statistical offices'

In [54]:
boston.sample(10)

,Name,len_Name,Age,M/F,City,City1,City2,State,Country,Official Time,Overall,Gender,Years Ran
576,"Allen, Christopher",18,28,M,Ventura,Ventura,NaN,CA,USA,2:49:50,577,539,NaN
113,"Mclaughlin, Pat",15,27,M,Maple Glen,Maple Glen,NaN,PA,USA,2:36:28,114,101,NaN
885,"White, Laurent",14,37,M,Flemington,Flemington,NaN,NJ,USA,2:54:50,886,837,NaN
294,"Hilty, Jonathan B.",18,34,M,Seattle,Seattle,NaN,WA,USA,2:43:59,295,269,NaN
933,"Carley, Seth A",14,28,M,Nashville,Nashville,NaN,TN,USA,2:55:20,934,883,NaN
874,"Bardey, Jonathan A",18,36,M,New York City,New York City,NaN,NY,USA,2:54:39,875,826,NaN
696,"Grassmeyer, Justin",18,27,M,Omaha,Omaha,NaN,NE,USA,2:52:01,697,656,NaN
637,"Bugbee, Patrick",15,33,M,Cambridge,Cambridge,NaN,MA,USA,2:50:58,638,598,2016
483,"Halusan, Brian M.",17,47,M,New York,New York,NaN,NY,USA,2:48:18,484,449,NaN
558,"Mcdonough, Bobby",16,24,M,Allston,Allston,NaN,MA,USA,2:49:38,559,521,NaN

In [63]:
# replaceM with male and f with female
boston["M/F"].str.replace("M","Male").str.replace("F", "Female").value_counts()

Male      944
Female     56
Name: M/F, dtype: int64